<a href="https://colab.research.google.com/github/xanasa14/Finances/blob/main/BuySell.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Importing needed libraries

import pandas as pd
import numpy as np
from datetime import datetime
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

In [6]:
stock_price_df = pd.read_csv('/content/drive/MyDrive/YahooData/YahooFinanceData.csv')
print(stock_price_df.head())
print(stock_price_df.tail())


df = pd.DataFrame()
df['AMZN'] = stock_price_df['AMZN'].values
df

         Date         MMM        AOS  ...         ZBH       ZION        ZTS
0  2017-01-03  178.050003  47.500000  ...  103.330002  43.180000  53.590000
1  2017-01-04  178.320007  47.919998  ...  104.279999  43.799999  54.110001
2  2017-01-05  177.710007  47.700001  ...  104.949997  43.090000  53.930000
3  2017-01-06  178.229996  47.720001  ...  104.959999  43.369999  54.099998
4  2017-01-09  177.270004  47.400002  ...  107.000000  42.900002  53.950001

[5 rows x 396 columns]
            Date         MMM        AOS  ...         ZBH       ZION         ZTS
1072  2021-04-08  195.720001  66.830002  ...  164.539993  55.000000  160.000000
1073  2021-04-09  198.000000  67.269997  ...  169.479996  55.939999  159.850006
1074  2021-04-12  197.830002  68.410004  ...  168.330002  56.580002  162.509995
1075  2021-04-13  196.470001  67.650002  ...  168.470001  55.529999  163.470001
1076  2017-09-04         NaN        NaN  ...         NaN        NaN         NaN

[5 rows x 396 columns]

             AMZN
0      753.669983
1      757.179993
2      780.450012
3      795.989990
4      796.919983
...           ...
1072  3299.300049
1073  3372.199951
1074  3379.389893
1075  3400.000000
1076          NaN

[1077 rows x 1 columns]